# Working with MSExcel Spreadsheets

In [2]:
# import the pandas library
import pandas as pd

In [3]:
# Read data from each MSExcel spreadsheets
df1 = pd.read_excel("./datasets/Aracaju.xlsx")
df2 = pd.read_excel("./datasets/Fortaleza.xlsx")
df3 = pd.read_excel("./datasets/Natal.xlsx")
df4 = pd.read_excel("./datasets/Recife.xlsx")
df5 = pd.read_excel("./datasets/Salvador.xlsx")

In [4]:
# Concatenate all dataframe in a new dataframe
df = pd.concat([df1,df2,df3,df4,df5])
df = df.rename(columns={"Cidade":"CITY", "Data": "DATE", "Vendas": "SALES", "LojaID": "STORE_ID", "Qtde": "QUANTITY"})
df.head()

      CITY       DATE   SALES  STORE_ID  QUANTITY
0  Aracaju 2018-01-01  142.00      1520         1
1  Aracaju 2018-01-01   14.21      1522         6
2  Aracaju 2018-01-01   71.55      1520         1
3  Aracaju 2018-01-01    3.01      1521         7
4  Aracaju 2018-01-01   24.51      1522         8

In [5]:
# Visualize the last five rows of the dataframe
df.tail()

         CITY       DATE   SALES  STORE_ID  QUANTITY
235  Salvador 2019-01-03   41.84      1034         1
236  Salvador 2019-01-03  126.29      1035         3
237  Salvador 2019-01-03   38.06      1036         3
238  Salvador 2019-01-03  139.64      1035         1
239  Salvador 2019-01-03  161.41      1037         3

In [6]:
# Get a sample of the rows of the dataframe
df.sample(5)

         CITY       DATE   SALES  STORE_ID  QUANTITY
88  Fortaleza 2019-01-01   68.60      1004         6
0   Fortaleza 2019-01-01   45.27      1002         2
11  Fortaleza 2019-01-01   42.19      1003         3
32   Salvador 2019-01-01  151.27      1035         1
7   Fortaleza 2019-02-11   35.50      1003         2

In [7]:
# Get types of each column
df.dtypes

CITY                object
DATE        datetime64[ns]
SALES              float64
STORE_ID             int64
QUANTITY             int64
dtype: object

In [8]:
# Change the data type of a column
df["STORE_ID"] = df["STORE_ID"].astype("object")
df.dtypes

CITY                object
DATE        datetime64[ns]
SALES              float64
STORE_ID            object
QUANTITY             int64
dtype: object

In [9]:
# Verify if there are null values in a dataframe
df.isnull().sum()

CITY        0
DATE        0
SALES       0
STORE_ID    0
QUANTITY    0
dtype: int64

In [10]:
# Get mean of sales
df["SALES"].mean()

122.61180089485458

In [13]:
# If a dataframe has null values (na or N/A) you can replace them for a given value like zero or 
# mean or even remove those rows.
df["SALES"].fillna(df["SALES"].mean(), inplace=True)
df["SALES"].fillna(0, inplace=True)
df.dropna(inplace=True)

In [14]:
# Drop only the rows with null values in a specific column
df.dropna(subset=["SALES"], inplace=True)

In [15]:
# Drop only rows with null values in all the columns
df.dropna(how="all", inplace=True)

In [17]:
# creating new columns
df["INCOME"] = df["SALES"].mul(df["QUANTITY"])
df.head()

      CITY       DATE   SALES STORE_ID  QUANTITY  INCOME
0  Aracaju 2018-01-01  142.00     1520         1  142.00
1  Aracaju 2018-01-01   14.21     1522         6   85.26
2  Aracaju 2018-01-01   71.55     1520         1   71.55
3  Aracaju 2018-01-01    3.01     1521         7   21.07
4  Aracaju 2018-01-01   24.51     1522         8  196.08

In [18]:
# use operators to create a new column
df["INCOME/SALES"] = df["INCOME"] / df.SALES
df.head()

      CITY       DATE   SALES STORE_ID  QUANTITY  INCOME  INCOME/SALES
0  Aracaju 2018-01-01  142.00     1520         1  142.00           1.0
1  Aracaju 2018-01-01   14.21     1522         6   85.26           6.0
2  Aracaju 2018-01-01   71.55     1520         1   71.55           1.0
3  Aracaju 2018-01-01    3.01     1521         7   21.07           7.0
4  Aracaju 2018-01-01   24.51     1522         8  196.08           8.0

In [20]:
# Get max value of a column
df.INCOME.max()

3544.0

In [21]:
# Get min value of a column
df.INCOME.min()

3.34

In [22]:
# Get the top three largest values of of a column
df.nlargest(3, "INCOME")

     CITY       DATE  SALES STORE_ID  QUANTITY  INCOME  INCOME/SALES
7   Natal 2019-03-18  886.0      853         4  3544.0           4.0
51  Natal 2018-01-21  859.0      852         4  3436.0           4.0
55  Natal 2019-01-08  859.0      854         4  3436.0           4.0

In [23]:
# Get the top three smallest values of of a column
df.nsmallest(3, "INCOME")

        CITY       DATE  SALES STORE_ID  QUANTITY  INCOME  INCOME/SALES
118  Aracaju 2018-01-01   3.34     1522         1    3.34           1.0
65    Recife 2019-01-01   4.01      981         1    4.01           1.0
92     Natal 2019-01-02   4.57     1035         1    4.57           1.0

In [24]:
# Group by city and return income sum
df.groupby("CITY")["INCOME"].sum()

CITY
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: INCOME, dtype: float64

In [26]:
# Sort a dataframe by a specific column
df.sort_values("INCOME", ascending=False).head(10)

     CITY       DATE  SALES STORE_ID  QUANTITY  INCOME  INCOME/SALES
7   Natal 2019-03-18  886.0      853         4  3544.0           4.0
55  Natal 2019-01-08  859.0      854         4  3436.0           4.0
51  Natal 2018-01-21  859.0      852         4  3436.0           4.0
30  Natal 2018-10-02  856.0      853         4  3424.0           4.0
41  Natal 2018-05-20  835.0      852         4  3340.0           4.0
38  Natal 2018-02-25  828.0      852         4  3312.0           4.0
10  Natal 2018-10-27  828.0      852         4  3312.0           4.0
69  Natal 2019-03-24  817.0      852         4  3268.0           4.0
62  Natal 2018-02-10  793.0      854         4  3172.0           4.0
52  Natal 2018-04-27  778.0      854         4  3112.0           4.0